<?php
/**
 * @File		arrayInfo
 * @Date		2016. 08. 10
 * @Author		비스톤스
 * @Brief		배열관리
 */
//------------------------------
// 제품 스펙
//------------------------------		
$arrSectionSpecValue = Array (
	"1인","2인","3인","4인","카우치","코너","스툴","쿠션"
);
$arrFinishingMaterialSpecValue = Array (
	"가죽 - 내츄럴","가죽 - 프로텍터","가죽 - 스플리트","인조가죽 - 본디드","패브릭","마이크로파이버"
);
$arrInteriorMaterialSpecValue = Array (
	"섬유","섬유 - 클리마라이트","에코플렉스폼","메모리폼","구스+섬유 믹스","구스"
);
$arrLegSpecValue1 = Array (
	"우드-<br>다크내츄럴","우드- 월넛","우드- 체리","우드- 웬지","우드- 로즈우드","우드- 커피오크","우드- 스모크오크","우드- 올리브월넛","우드- 마카사르"
);
$arrLegSpecValue2 = Array (
	"메탈-<br>글레이즈드 니켈","메탈-<br>브론즈 로즈","메탈-<br>글로시 크롬","메탈-<br>블랙 크롬","메탈-<br>퓨터","메탈-<br>글레이즈드 브론즈","플라스틱"
);
$arrSeatFeelSpecValue = Array (
	"소프트","라이트 소프트","보통","소프트 하드","하드"
);
$arrFunctionSpecValue = Array (
	"헤드레스트 조절","수동 리클라이너","전동 리클라이너","슬라이딩","베드","팔걸이 조절","수납","사운드<br>(블루투스스피커)","조명"
);
$arrItemsSpecValue = Array (
	"콘트라스트 스티칭","오픈컷 스티칭","좌판 쿠션분리","등받이 쿠션분리","커버 분리"
);


//------------------------------
// 제품 유형
//------------------------------		
$arrGoodsType = Array (
	"1", "italia",
	"2", "revive",
	"3", "edition"
);
$arrGoodsType2 = Array (
	"1", "italia",
	"2", "revive",
	"3", "editions"
);
$arrGoodsType3 = Array (
	"1", "italia",
	"2", "re-vive",
	"3", "edition"
);

//------------------------------
// 제품 유통사 유형
//------------------------------		
$arrDistributorType = Array (
	"", "전체",
	"1", "백화점",
	"2", "직영점",
	"3", "대리점",
	"4", "한샘"
);

//------------------------------
// Italia 제품 카테고리 유형
//------------------------------		
$arrItaliaCate = Array (
	"", "전체",
	"1", "Sofas",  
	"2", "Arm chairs",  
	"3", "Beds",  
	"4", "Tables",  
	"5", "Rugs",  
	"6", "Lamps",  
	"7", "Night&Day",  
	"8", "Accessories"
);

//------------------------------
// RE-VIVE 제품 카테고리 유형
//------------------------------		
$arrReviveCate = Array (
	"", "전체", 
	"1", "Arm chairs" 
);


//------------------------------
// Edition 제품 카테고리 유형
//------------------------------		
$arrEditionCate = Array (
	"", "전체",
	"1", "Sofas",
	"2", "Arm chairs",
	"3", "Tables",
	"4", "Rugs"
);

//------------------------------
// 노출 유형
//------------------------------		
$arrUseYn = Array (
	"Y", "노출",
	"N", "비노출"
);

//------------------------------
// 회원관리 - 이메일 수신 동의 여부 
//------------------------------		
$arrEmailYn = Array (
	"", "전체",
	"Y", "수신",
	"N", "미수신"
);
$arrEmailYn_control = Array (
	""  => " ",
	"Y" => "수신",
	"N" => "미수신"
);

//------------------------------
// 회원관리 검색 배열
//------------------------------		
$arrUserSearchKey = Array (
	"user_name",		"이름",
	"user_id",			"아이디",
	"mobile",			"휴대폰번호"
);

//------------------------------
// 회원 - 휴대폰
//------------------------------		
$arrMobileType = Array (
	"", "선택",
	"010", "010",
	"011", "011",
	"016", "016",
	"017", "017",
	"018", "018",
	"019", "019"
);

//------------------------------
// 회원 - 자택전화 
//------------------------------		
$arrHomeMobileType = Array (
	"", "선택",
	"02", "02",
	"031", "031",
	"032", "032",
	"033", "033",
	"041", "041",
	"042", "042",
	"043", "043",
	"051", "051",
	"052", "052",
	"053", "053",
	"054", "054",
	"055", "055",
	"061", "061",
	"062", "062",
	"063", "063",
	"064", "064",
	"070", "070",
	"0502", "0502"
);

//------------------------------
// 회원 - 이메일
//------------------------------		
$arrEmailType = Array (
	"", "직접입력",
	"naver.com", "naver.com",
	"gmail.com", "gmail.com",
	"daum.net", "daum.net",
	"nate.com", "nate.com",
	"hotmail.com", "hotmail.com",
	"hanmail.com", "hanmail.com",
	"yahoo.com", "yahoo.com"
);

//------------------------------
// 회원 - 성별
//------------------------------		
$arrSexType = Array (
	"M", "남성",
	"G", "여성"
);

//------------------------------
// 회원 - 주거형태 유형
//------------------------------		
$arrDwellinType = Array (
	"", "선택",
	"1", "아파트",
	"2", "오피스텔",
	"3", "주택",
	"4", "빌라"
);
$arrDwellinTypeExcel = Array (
	"아파트",
	"오피스텔",
	"주택",
	"빌라"
);
//------------------------------
// 회원 - 자택면적 유형
//------------------------------		
$arrSurfaceType = Array (
	"", "선택",
	"1", "0~66",
	"2", "66~99",
	"3", "99~132",
	"4", "132~165",
	"5", "165이상"
);	
$arrSurfaceTypeExcel = Array (
	"0~66",
	"66~99",
	"99~132",
	"132~165",
	"165이상"
);

//------------------------------
// 회원 - 자택면적 유형 Detail
//------------------------------		
$arrSurfaceDetailType = Array (
	"1", "0~66 (20평 이하)",
	"2", "66~99 (20평형대)",
	"3", "99~132 (30평형대)",
	"4", "132~165 (40평형대)",
	"5", "165이상 (50평 이상)"
);

//------------------------------
// 이벤트 - 검색 배열
//------------------------------		
$arrEventProcessYn = Array (
	"","전체",
	"future","예정",
	"ing","진행",
	"end","종료"
);

//------------------------------
// 고객센터 - 검색 타입 배열
//------------------------------		
$arrCustomerSearchType = Array (
	"1","이름",
	"2","아이디"
);

//------------------------------
// 고객센터 - 리스트 > 분류 배열
//------------------------------		
$arrCustomerListCategori = Array (
	"","전체",
	"1","칭찬",
	"2","문의",
	"3","불편"
);
$arrCustomerListCategori_control = Array (
	""  => "전체",
	"1" => "칭찬",
	"2" => "문의",
	"3" => "불편"
);

//------------------------------
// 고객센터 - 리스트 > 상태 배열
//------------------------------		
$arrCustomerListState = Array (
	"","전체",
	"1","접수",
	"2","처리중",
	"3","처리완료"
);
$arrCustomerListState_control = Array (
	""  => "전체",
	"1" => "접수",
	"2" => "처리중",
	"3" => "처리완료"
);

//------------------------------
// 고객센터 - 상세보기 > 상태 배열
//------------------------------		
$arrCustomerViewState = Array (
	"1","접수",
	"2","처리중",
	"3","처리완료"
);

//------------------------------
// 매장정보 - 지역 배열
//------------------------------		
$arrAreaType = Array (
	"",								"전체",
	"서울특별시",				"서울특별시",
	"강원도",					"강원도", 
	"경기도",					"경기도",
	"경상남도",					"경상남도",
	"경상북도",					"경상북도",
	"광주광역시",				"광주광역시",
	"대구광역시",				"대구광역시",
	"대전광역시,",				"대전광역시",
	"부산광역시",				"부산광역시",
	"세종특별자치시",			"세종특별자치시",
	"울산광역시",				"울산광역시",
	"인천광역시",				"인천광역시",
	"전라남도",					"전라남도",
	"전라북도",					"전라북도",
	"제주특별자치도",			"제주특별자치도", 
	"충청남도",					"충청남도",
	"충청북도",					"충청북도"
);
$arrSearchAreaType = Array (
	"",								"지역",
	"서울특별시",				"서울특별시",
	"강원도",					"강원도", 
	"경기도",					"경기도",
	"경상남도",					"경상남도",
	"경상북도",					"경상북도",
	"광주광역시",				"광주광역시",
	"대구광역시",				"대구광역시",
	"대전광역시,",				"대전광역시",
	"부산광역시",				"부산광역시",
	"세종특별자치시",			"세종특별자치시",
	"울산광역시",				"울산광역시",
	"인천광역시",				"인천광역시",
	"전라남도",					"전라남도",
	"전라북도",					"전라북도",
	"제주특별자치도",			"제주특별자치도", 
	"충청남도",					"충청남도",
	"충청북도",					"충청북도"
);
//------------------------------
// 매장정보 - 브랜드 배열
//------------------------------		
$arrBrandType = Array (
	"", "전체",
	"1","나뚜찌 이탈리아",
	"2","나뚜찌 리바이브",
	"3","나뚜찌 에디션"
);		
$arrSearchBrandType = Array (
	"", "브랜드",
	"1","나뚜찌 이탈리아",
	"2","나뚜찌 리바이브",
	"3","나뚜찌 에디션"
);
$arrSearchBrandType_after = Array (
	"", "브랜드",
	"1","나뚜찌 이탈리아",
	"3","나뚜찌 에디션",
	"13","나뚜찌 이탈리아, 에디션"
);

//------------------------------
// 매장정보 - 유통사 배열
//------------------------------		
$arrDistributorType = Array (
	"", "전체",
	"1","백화점",
	"2","직영점",
	"3","대리점",
	"4","한샘"
);

//------------------------------
// 매장정보 - 오픈, 종료 시간
//------------------------------		
$arrStoreOpenCloseDate = Array (
	"", "선택 없음",
	"1", "08 : 00",
	"2", "08 : 30",
	"3", "09 : 00",
	"4", "09 : 30",
	"5", "10 : 00",
	"6", "10 : 30",
	"7", "11 : 00",
	"8", "11 : 30",
	"9", "12 : 00",
	"10", "12 : 30",
	"11", "13 : 00",
	"12", "13 : 30",
	"13", "14 : 00",
	"14", "14 : 30",
	"15", "15 : 00",
	"16", "15 : 30",
	"17", "16 : 00",
	"18", "16 : 30",
	"19", "17 : 00",
	"20", "17 : 30",
	"21", "18 : 00",
	"22", "18 : 30",
	"23", "19 : 00",
	"24", "19 : 30",
	"25", "20 : 00",
	"26", "20 : 30",
	"27", "21 : 00",
	"28", "21 : 30",
	"29", "22 : 00",
	"30", "22 : 30",
	"31", "23 : 00",
	"32", "23 : 30",
	"33", "00 : 00"
);


?>
